Classes | Enumerations | Functions
Model Quality Check Management
Functions and classes related to Model Quality Check services. More...
 Classes
class  | ACAPI::ModelCheckManager
ModelCheckManager is a class to access the Model Quality Check services. More...
class  | ACAPI::ModelCheckResult
The type of the check result returned by the AddOn. More...
class  | ACAPI::ModelCheckMethodCallback
ModelCheckMethodCallback is responsible for registering and handling Model Quality Check methods through API. You can make your own implementation to extend the list of Model Check Methods with your own check logic. More...
 Enumerations
enum class  | ACAPI::ModelCheckSettingType {
 OnlySelection , Angle , Length , Area ,
 Real , Interval
 }
The type of the model check criteria.
 Functions
ModelCheckManager  | ACAPI::GetModelCheckManager ()
A function to create ModelCheckManager instance.
MEPAPI_EXPORT API_Guid  | ACAPI::MEP::GetMEPModelCheckTypeId ()
Detailed Description
Functions and classes related to Model Quality Check services.
Function Documentation
◆ GetMEPModelCheckTypeId()
 MEPAPI_EXPORT API_Guid ACAPI::MEP::GetMEPModelCheckTypeId  |  ( |   | )
Since
Archicad 29
Returns
Returns the unique identifier of the MEP Model Check Type
◆ GetModelCheckManager()
 ModelCheckManager ACAPI::GetModelCheckManager  |  ( |   | )
inline
A function to create ModelCheckManager instance.
Since
Archicad 29
Returns
Returns the ModelCheckManager instance.